Belief997/lab-Micro_power_consumption_backscatter/SDK_2.3.1_MKL03Z32xxx4/boards/frdmkl03z/demo_apps/power_mode_switch/power_mode_switch.c
#if WAKEUP_ENABLE
#define SLEEP_CNT 90000
    	u32 debug_cnt = 0;
#endif
    	u8 cntBit = 0;
        while (1)
        {
            /* Prevents the use of wrong values */
            while (!conversionCompleted)
            {
            }
//            GPIO_PortToggle(GPIOA, 1u << 5U);
//            GPIO_PortToggle(GPIOB, 1u << 3U);

#if WAKEUP_ENABLE
            // hold output for about xxx sec

			if(debug_cnt++ > SLEEP_CNT)
			{
				debug_cnt = 0;
				PRINTF("  SLEEP.. \r\n");
				break;
			}
			else if(debug_cnt++ == SLEEP_CNT/2)
			{
				PRINTF("  SLEEP half time pass... \r\n");
            }

#endif

            // debug
//            if(0)
            {
            	static ADC_PACK adc_pack = {0};
            	static u32 adc_sum = 0;

            	ADC_DATA adc = {0};

            	data_dequeueadc(&adc);
            	adc_sum += adc.adcValue;

            	// 第一次发或发完一帧
            	if(cntBit % ADC_PACK_LEN == 0)
            	{
            		adc_pack.header = ADC_HEADER;
            		adc_pack.data = cntBit ? adc_sum / ADC_PACK_LEN : adc_sum ;
            		adc_sum = 0;

            		cntBit = 0;
            	}

            	// send header
            	if(cntBit < ADC_HEADER_LEN)
            	{
            		GPIO_WritePinOutput(GPIOB, 3U, (adc_pack.header >> (ADC_HEADER_LEN - cntBit - 1)) & 0x01);
            		adc_pack.check = 0;
            	}
            	else if(cntBit < ADC_HEADER_LEN + ADC_DATA_LEN)
            	{
            		u8 sendBit = (adc_pack.data >> (ADC_HEADER_LEN + ADC_DATA_LEN - cntBit - 1)) & 0x01;
            		GPIO_WritePinOutput(GPIOB, 3U, sendBit);
            		adc_pack.check ^= sendBit & 0x01;
            	}
            	else
            	{
            		GPIO_WritePinOutput(GPIOB, 3U, adc_pack.check);
//            		PRINTF("%x %x %x\n\r", adc_pack.header, adc_pack.data, adc_pack.check);
            	}

            	cntBit ++;
//            	PRINTF("%d\n\r", cntBit);
            }
            conversionCompleted = false;

        }

#if WAKEUP_ENABLE
    // enter vlls3 mode
    {
        curPowerState = kSMC_PowerStateVlpr;
        targetPowerMode = (app_power_mode_t)kAPP_PowerModeVlls3;
        //needSetWakeup = true;
        APP_GetWakeupConfig(targetPowerMode);
        APP_PowerPreSwitchHook(curPowerState, targetPowerMode);
        APP_SetWakeupConfig(targetPowerMode);
        APP_PowerModeSwitch(curPowerState, targetPowerMode);
        APP_PowerPostSwitchHook(curPowerState, targetPowerMode);
    }
#endif

    return 0;
}

